DELETE FROM roles;
DELETE FROM users;
DELETE FROM restaurants;
DELETE FROM dishes;
DELETE FROM menu_lists;
DELETE FROM orders;

ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users(name,email,password) VALUES
  ('Алексей Иванов','ivanov.alexey@gmail.com','111'),
  ('Андрей Горбунов','andrunov@gmail.com','222'),
  ('Павел Сидоров','sidor@gmail.com','333'),
  ('Roberto Zanetti','rzanetti@gmail.com','444'),
  ('John Bon Jovi','jbj@gmail.com','555'),
  ('Didier Maoruani','dmauruani@gmail.com','666');

INSERT INTO roles(user_id, role) VALUES
  (100000,'USER'),
  (100001,'USER'),
  (100001,'ADMIN'),
  (100002,'USER'),
  (100003,'USER'),
  (100004,'USER'),
  (100005,'USER');

INSERT INTO restaurants(name, address) VALUES
  ('Ёлки-палки','ул. Некрасова, 14'),
  ('Пиццерия','пл. Пушкина, 6'),
  ('Закусочная','Привокзальная пл, 3'),
  ('Прага','ул. Арбат, 1');

INSERT INTO dishes(description,price) VALUES
  ('Каша овсяная',1.25),
  ('Сырники',3.45),
  ('Блины',2.48),
  ('Суп гороховый',5.57),
  ('Рассольник',6.87),
  ('Жульен с грибами',12.47),
  ('Пельмени',7.96),
  ('Котлета по киевски',14.58),
  ('Чай черный',0.55),
  ('Чай зеленый',0.55),
  ('Кофе черный',0.75),
  ('Кофе белый',0.95),
  ('Котлета по питерски',12.54),
  ('Поросенок под хреном',24.58),
  ('Чебурек',4.62),
  ('Беляш',4.12),
  ('Чай черный с лимоном',1.95),
  ('Борщ',17.58),
  ('Плов узбекский',12.75),
  ('Салат оливье',8.12);

INSERT INTO menu_lists(restaurant_id, dish_id) VALUES
  (100006,100010),
  (100006,100011),
  (100006,100012),
  (100006,100013),
  (100006,100014),

  (100007,100015),
  (100007,100016),
  (100007,100017),
  (100007,100018),

  (100008,100019),
  (100008,100020),
  (100008,100021),
  (100008,100022),
  (100008,100023),

  (100009,100024),
  (100009,100025),
  (100009,100026),
  (100009,100027),
  (100009,100028),
  (100009,100029);

INSERT INTO orders(user_id, restaurant_id, dish_id, date_time) VALUES
  (100000,100006,100010,'2017-01-15 15:47:00'),
  (100000,100006,100011,'2017-01-15 15:47:00'),
  (100000,100006,100013,'2017-01-15 15:47:00'),


  (100001,100006,100010,'2017-01-14 18:49:00'),
  (100001,100006,100011,'2017-01-14 18:49:00'),
  (100001,100006,100013,'2017-01-14 18:49:00'),
  (100001,100006,100014,'2017-01-14 18:49:00'),


  (100002,100007,100015,'2017-01-15 12:07:00'),
  (100002,100007,100016,'2017-01-15 12:07:00'),
  (100002,100007,100017,'2017-01-15 12:07:00'),

  (100003,100007,100017,'2017-01-15 02:09:00'),
  (100003,100007,100018,'2017-01-15 02:09:00'),


  (100004,100008,100019,'2017-01-15 14:17:00'),
  (100004,100008,100020,'2017-01-15 14:17:00'),

  (100005,100009,100024,'2017-01-15 09:29:00'),
  (100005,100009,100025,'2017-01-15 09:29:00'),
  (100005,100009,100026,'2017-01-15 09:29:00'),
  (100005,100009,100027,'2017-01-15 09:29:00'),
  (100005,100009,100028,'2017-01-15 09:29:00'),
  (100005,100009,100029,'2017-01-15 09:29:00');
